04_OpenFoam/_Tut_02/OpenFOAM-14/multicomponentFluid/smallPoolFire3D/constant/reactionProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

reactionModel infinitelyFastChemistry;

infinitelyFastChemistry
{
    semiImplicit no;
    C       5.0;
}

#include "reaction"

// ************************************************************************* //
