04_OpenFoam/_Tut_02/OpenFOAM-14/multicomponentFluid/smallPoolFire3D/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication createPatch
runApplication decomposePar -force
runParallel foamRun
runApplication reconstructPar

#------------------------------------------------------------------------------
